JP-REY/STM32F103C8T6-Based-Electronic-Lock/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_ON_BOARD_Pin GPIO_PIN_13
#define LED_ON_BOARD_GPIO_Port GPIOC
#define MKB_ROW3_Pin GPIO_PIN_0
#define MKB_ROW3_GPIO_Port GPIOA
#define MKB_ROW3_EXTI_IRQn EXTI0_IRQn
#define MKB_ROW2_Pin GPIO_PIN_1
#define MKB_ROW2_GPIO_Port GPIOA
#define MKB_ROW2_EXTI_IRQn EXTI1_IRQn
#define MKB_ROW1_Pin GPIO_PIN_2
#define MKB_ROW1_GPIO_Port GPIOA
#define MKB_ROW1_EXTI_IRQn EXTI2_IRQn
#define MKB_ROW0_Pin GPIO_PIN_3
#define MKB_ROW0_GPIO_Port GPIOA
#define MKB_ROW0_EXTI_IRQn EXTI3_IRQn
#define MKB_COL0_Pin GPIO_PIN_4
#define MKB_COL0_GPIO_Port GPIOA
#define MKB_COL1_Pin GPIO_PIN_5
#define MKB_COL1_GPIO_Port GPIOA
#define MKB_COL2_Pin GPIO_PIN_6
#define MKB_COL2_GPIO_Port GPIOA
#define MKB_COL3_Pin GPIO_PIN_7
#define MKB_COL3_GPIO_Port GPIOA
#define STATUS_LED_RED_Pin GPIO_PIN_12
#define STATUS_LED_RED_GPIO_Port GPIOA
#define STATUS_LED_BLUE_Pin GPIO_PIN_15
#define STATUS_LED_BLUE_GPIO_Port GPIOA
#define BUZZER_PWM_TIM3CH1_Pin GPIO_PIN_4
#define BUZZER_PWM_TIM3CH1_GPIO_Port GPIOB
#define PCF8574_SCL_I2C1_Pin GPIO_PIN_6
#define PCF8574_SCL_I2C1_GPIO_Port GPIOB
#define PCF8574_SDA_I2C1_Pin GPIO_PIN_7
#define PCF8574_SDA_I2C1_GPIO_Port GPIOB
#define LOCKER_PIN_Pin GPIO_PIN_8
#define LOCKER_PIN_GPIO_Port GPIOB
#define HD44780_BRIGHTNESS_PWM_TIM4CH4_Pin GPIO_PIN_9
#define HD44780_BRIGHTNESS_PWM_TIM4CH4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
